<!DOCTYPE html>

<html id="main_page" lang="it">
    
    <head>
        <link rel="shortcut icon" type="image/x-icon" href="logo.svg" />
        <title>Documentazione</title>
        
        <style>
            footer{
                position: absolute;
                bottom: 30px;
            }
            ul{
                list-style-type: none;
            }
            .tab1{
                margin-left:1em;
                margin-top: 1em;
            }
            .tab2{
                margin-left:2em;
            }
        </style>
    
    </head>

    <body>
        <h1>DOCUMENTAZIONE</h1>
        <p>
            Il sito si propone di consentire all'utente di configurare un PC fisso partendo dalle sue componenti. In particolare, la scelta dell'utente sar&agrave; guidata verso una configurazione sicuramente funzionante in quanto avr&agrave; la possibilit&agrave; di scegliere solo componenti che risultano essere compatibili tra loro.</p>
<p>Innanzitutto, l'utente, se &egrave; la prima volta che accede, dovr&agrave; effettuare la registrazione. Per farlo, bisogner&agrave; cliccare nell'immagine raffigurante il busto di un omino stilizzato (alla quale di seguito ci riferiremo per semplicit&agrave; come "immagine dell'account") e da li andare sulla voce "Registrati". Cliccando si aprir&agrave; una finestra in cui l'utente dovr&agrave; scegliere un username, una password e il tipo di utente che definisce le necessit&agrave; per cui si vuole realizzare un PC. La scelta disponibile sar&agrave; tra lavoratore, studente, gamer o, qualora l'utente non si riveda in nessuno dei profili menzionati, altro. Una volta registrato, per accedere al servizio all'utente baster&agrave; effettuare il login, accendendovi cliccando nell'immagine dell'account, cliccando su "Login" e immettendo, nella nuova pagina in cui si &egrave; indirizzati, username e password.</p>
<p>I dati dell'utente possono essere modificati in qualunque momento. Per farlo bisogner&agrave; cliccare sull'immagine dell'account e cliccare sulla voce "Gestisci". A questo punto si verr&agrave; indirizzati ad una pagina in cui vi &egrave; la possibilit&agrave;, mediante tre comandi, di modificare l'username, la password o il tipo dell'utente. Per ciascuna delle modifiche bisogner&agrave; inserire come conferma la password attuale.</p>
<p>La navigazione all'interno del sito avviene mediante la barra rossa che vi &egrave; in alto, alle quali si pu&ograve; accedere alla home, alla sezione delle configurazioni e a quella del building. Per accedere all'ultima delle pagine principali bisogner&agrave; cliccare sull'immagine dell'account e cliccare sulla voce "Le mie configurazioni".
Di seguito vengono riportate le caratteristiche nel dettaglio delle quattro pagine principali:
<ul>
<li class="tab1">-	HOME, priva di funzionalit&agrave;</li>
<li class="tab1">-   CONFIGURAZIONI, all'interno della quale l'utente ha la possibilit&agrave; di visualizzare tre configurazioni di PC gi&agrave; assemblati, uno di fascia bassa, uno di fascia media, uno di fascia alta, realizzate a seconda delle sue esigenze. Le esigenze dell'utente variano a seconda del tipo di utente scelto in fase di registrazione. </li>
<li class="tab1">-	BUILDING, dove l'utente ha la possibilit&agrave; di configurare un setup di PC e salvarlo all'interno delle sue configurazioni. Il salvataggio sar&agrave; possibile una volta inseriti alcuni dati fondamentali, ovvero il titolo della configurazione e un numero di componenti che consenta il funzionamento del PC realizzato. In particolare, le componenti che possono essere omesse sono:<ul>
<li class="tab2">o	La scheda video, solo nel caso in cui il processore scelto presenti una scheda grafica integrata;</li>
<li class="tab2">o	SSD, solo nel caso in cui &egrave; gi&agrave; stato scelto un hard disk.</li>
<li class="tab2">o	HARD DISK, solo nel caso in cui &egrave; gi&agrave; stato scelto un ssd;</li>
<li class="tab2">o	MONITOR, in qualunque caso (in effetti la presenza del monitor non determina il funzionamento del pc, ma in fase di configurazione si &egrave; ritenuto opportuno inserire alcuni suggerimenti di monitor). </li></ul>
Ogni volta che viene scelta una componente, si pu&ograve; eliminare la sua selezione mediante il tasto unselect posto alla destra del nome della componente scelta. Verranno visualizzate a video, al momento della selezione della componente, solo il nome della componente che permette di identificarla univocamente. Una volta effettuata la scelta, qualora l'utente volesse visualizzare una scheda tecnica, pu&ograve; semplicemente cliccare sul nome della componente e visualizzer&agrave; mediante popup informazioni dettagliate sull'articolo scelto, oltre ad avere la possibilit&agrave; di visualizzare lo stesso articolo su Amazon mediante l'ultima voce della tabella.</li>
<li class="tab1">-	LE MIE CONFIGURAZIONI, dove l'utente ha la possibilit&agrave; di visualizzare, mediante il titolo, le configurazioni salvate in precedenza. Per ciascuna configurazione vi &egrave; la possibilit&agrave; di eseguire alcune operazioni:<ul>
<li class="tab2">o	VISUALIZZA, in cui viene mostrato mediante popup l'elenco delle componenti che costituiscono la configurazione in oggetto;</li>
<li class="tab2">o	CONFIGURA, mediante cui verr&agrave; aperta la stessa configurazione all'interno dell'area Building;</li>
<li class="tab2">o	ELIMINA, mediante cui verr&agrave; cancellata la configurazione in oggetto.</li></ul>
Non vi sono limiti riguardo i salvataggi delle configurazioni, per cui l'utente potrebbe decidere di assegnare a due configurazioni lo stesso nome.</li>
</ul>
        

        <footer>
            <a href="Index.html">GO BACK</a>
        </footer>
    </body>

</html>
